{"id":"2020-japan-23","collection":"2020-japan","date":"2020 February 23","title":"Onomichi → Imabari - Shimanami Kaido Cycle 76km","content":"As expected, today was a very big day, but thankfully I made it, and without having to rush to make it in time before sunset!\n\nI got up to have breakfast in the hotel pretty much as early as I could. This was a nice salad, bread, and croissant buffet, with the choice of eggs and ham or eggs and sausage to go with it.\n\nDuring check out I organised to have my main luggage delivered to my hotel in Imabari, which was an easy service to organise thanks to the frequency of this request meaning hotels have systems in place to do this.\n\nNext I picked up the rental bike a few minutes away - this was also easy enough due to the number of people doing this (this cycle route is becoming popular among locals and tourists). Finally I caught the ferry to the start point of the ride and got going!\n\nAbout 1km in while I was figuring out the gear situation on the bike, the chain fell off… There were 2 sets of gears, so I decided I would sit in the middle for the set with only 3 gears (I think this one was a bit sloppy and didn’t want the hassle of dealing with it more than once), but thankfully the other set (with 6-8 gears I think) was more robust. After getting grease all over my hands while getting the chain back on, I was on my way haha.\n\nThe rest of the ride was less eventful (thankfully), with the main standouts being the scenery - the Seto inland sea really is quite a remarkable and interesting place to see. So many islands scattered about, with the main ones along the route being visited via the 6 bridges connecting them. The hill climbs to these bridges were a little challenging, but still not too bad - I only walked 2 times through the entire ride, and one of those was a regular hill, not up to a bridge. The nice thing about those climbs though, was that you would always get some incredible views of the sea, islands, and bridge! There were plenty of rest areas along the route, so stopping to rest briefly and admire the sights was easy.\n\nLunch was half way at the “cyclist’s sanctuary” - a pit stop kind of area with a couple of take out places, one restaurant, vending machines for drinks, toilets, and some great views (it was on the water).\n\nThe second half was a bit more challenging, probably because of the building exhaustion of my legs, but there were enough milestones along the way to keep me focused and pushing forward. Then the final bridge… This thing was incredible! Over 4km long, it gave plenty of opportunity to look out over the sea and islands below. Once I cleared it, the rest was pretty much downhill, and I excitedly made my way to the rental bike drop off point.\n\nFrom there it was a short walk to my hotel for the night, which had already received my luggage when I checked in! Things were very smooth, and I was able to relax for the rest of the day - long showers and watching some TV from my phone!\n\nDinner was a Chinese chicken dish before I went and grabbed some dessert and a drink (cheaper from a convenience store)!","images":[{"src":"https://lh3.googleusercontent.com/d/17yTYq6FtvMkcQw2A2ANpoUqJ4ZSEiolu?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1ItKwVwfFh_ORdZoV7rG96wfSWJlVvYfS?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1gzuW9RoYXNK8rrVGO2aaqgo4kf1LqoC3?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1jp9y95iyVWyHEiUf0RnCXZPbJ6EBelEo?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1jKX1CzvjnU30ZTcxCSlyoJcXdAExl3Sk?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/19--49r4SjzWznTb9eY0RYBo9OcjKXMiG?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1pVnWj3w-XTa9YTRDD2M5FTlnY3z2fLkZ?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1etTzK2cOQf2ZVRLsKP7wiBcItDQ0BngS?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1179plvFM6sLAlvpd_Ir4QPgenWjLxH4K?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1aWycF1H_WkPilQWCGEdku24BKtv4UjEg?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1CC1vVMOe_YJqJSjdUx6Af_bYSJZteBEK?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1aiVFv_eNJ_MoYoq1RPUVwlHOTlKzrCP7?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1ZN_LPNZJpS_0UuDwS7SBEEvXs8oq9ZXa?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1TF0IBnkb704dR_XErAEOyQL4_mgibL3c?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1xyQKNDvCCKZy820zEGRA_CekvsewuSbI?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1wVpuPVY_qXH_pGdHj6k1FhUbHF8arucc?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1XdEm9nXqWMDUpieaP582472bv4h98U1Z?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/13wjjw45Dy7z3DMBqr0ptU6DLk0GvsH3u?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/19pm59r3oxKtlOfhOQFxPrIluORMkXMYn?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1JeNzD59qftX450TJ3elTg1Qnu8Sv6a8M?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1uE45tP9tUgXJtiazHUz1cZgiHmELmxcw?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/16BVh4y6iSEAxFvQiCpgvjDdSmAdwf5EE?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1z_5D3CutNr98w5r9oN5XOfijOsae9j0V?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1KY3mx54tttsJL7pWbKGS2A2bQXcXMMGM?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/10jz7uX8-f9fDuvb7E-9hBbZYorSFSY7d?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/12LP5B7OALuhOXivuQk9ALMQkOup745Wi?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1uCjqLBntlIbDcbOmkBk_Woyy150fapdG?authuser=0"}]}