{"id":"2020-japan-10","collection":"2020-japan","date":"2020 February 13","title":"Tokyo → Haguro - Mt Haguro hike","content":"This was the first day of 3 consecutive away from Tokyo.\n\nTravelling between 8am and 2pm pretty much, consisting of 2 long train rides (74 and 108 mins), then a local bus ride to reach my accommodation, which wasn’t far from the base of the hike up Mt Haguro.\n\nWhen I arrived I was greeted by the 2 very friendly hosts of the ryokan (he could speak some English, she couldn’t). It turns out I was the only guest staying with them tonight! They were very informative and explained the layout of the building and where the main areas were, then once they knew I was planning to hike up Mt Haguro, gave some advice and information on the condition of the trail! They even let me borrow an umbrella just in case I needed it for the hike!\n\nThe hike itself was impressive, both in scenery and challenge! There are over 2400 steps (according to the information pamphlet I was given about the mountain) - I can’t confirm this, as the area was fairly significantly under snow, and counting steps would have been way too much effort on top of just getting up them! As it turned out, I only just made it to the top - the steepness and difficulty of staying stable moving up snow covered stone steps almost made me turn back, but I managed to push onwards and made it.\n\nThe whole area is covered in huge cedar trees, and even with the snow cover it all looked really stunning! During the warmer months when there would be more greenery and easier hiking, it would be very impressive I’m sure.\n\nAt the top there were some decent views of the surrounds, though a bit blocked by trees. And there is a large shrine as well, that I imagine sees many visitors in the warmer months.\n\nThankfully the return trip was much easier despite the snow - getting foot holds was a lot easier when being able to lean a little back, and lead with my heels into the snowy steps.\n\nOnce I arrived back at the accommodation, the male host met me and was keen to hear if I made it, and how the snow was. He mentioned this has been a much warmer winter than normal, with less than half the snow they would normally see.\n\nDinner was at 6:30 and provided by the hosts. As I was the only one staying for the night, I could pick my time and had the dining area to myself. The meal was amazing! So much food, all very tasty, and immaculately presented! I tried to eat as much as I could, so as to not let any go to waste. I couldn’t quite get there, but put in a pretty good effort. When finished, I headed for my room, and thankfully caught their attention with my footsteps, resulting in a bit of a chat again. This gave me the chance to express my gratitude for the meal in English amd Japanese (one of the few words I know - “oishi” meaning “delicious!”). They both seemed quite happy, and after chatting a little again about my hike, I was able to prepare for a quiet night in my room, after a shower and bath (Japanese style).\n\nA long start to the day, but I’m very happy I managed to complete the hike, and don’t think I could have picked a better place to stay for the night!","images":[{"src":"https://lh3.googleusercontent.com/d/1DUp49uM-thUT_xtjXi2799GLqvutMuGc?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1PTseLkmu9y6zo3Kf1HAIxiR0wjyMRhBg?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1AZBFXZXQTy8U1SKI4JIJ5gBaXUOaxpJS?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1qVQlHsfpaGv9Oqa_H65D5qG_KVkkZDGG?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1QcnFGqbFX11UkDlllLAc-UA6LzM7OHIA?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1dHClIPNItG8JvKhhSbVK91S5FKvQisXL?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1n0io5LFgFUCZZdSyuEauB7-5PQElNsP7?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1iYQtDRGJe5ExwpADy2yd73CoOeZVYPNT?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/13weMhA_lqxiLWP6hKOj5J4sk0JAtqbuy?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1c4Ev_iBMmdyZiqaUhMEBanPQinJonI9u?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1POcjEgygJ8-I5zzDJQzCXASivnRPa1mV?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1PQTIhFRK0oj3qN2w-MZK0PdQLJjNXzTx?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1ppt42Pip_iMRVMAxFQ0JIK_d1rAhY4X4?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1aCGTzW8PFAkn9Qr94U9zlSY1yo9u8VeC?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1U9DmJ7Hz1WQbSqXzsSgc0nTNM1mYrJFZ?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1P8z-XfGOSiRI_TpauGb1hQOO5tip1pGg?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1c_5M7B9VPPpJrZMyzJy60JSE-UcMzPeB?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1z49tZtCpabgo86r3Ylu7tQgdnHIEp8Ci?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1rN2VZMAmKvJTI7UKDmsQ1bv18XVMnmBn?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/11rN0DUXbLHnPRe6q1TXYeR6G0CR4SByW?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1g_lZJhs60gH7NMc61joMGurzQoEBYDQJ?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/188aRnOBNrBA8Akv87KeEXN1r09-Tfhbr?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1f_3y_4D9LSnSy883FspK0E2_Ygdn89O3?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1C4oQCx5yFwjxg2rj1YrdrMsHMnCSib2p?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/18lwr2uW_-1UGOTqQ7Tq7JElZO2gUJW5g?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1fNR6WgDIn93aLBZlRTzkxWv6Iv7zhCSV?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1NquI-BG91zZ0tCBwKuepHL0Bg41fcXgv?authuser=0"}]}