{"id":"2020-japan-29","collection":"2020-japan","date":"2020 February 28","title":"Last day in Tokyo","content":"Today was the last day to wrap up the trip, with my flight home leaving around 9pm local time.\n\nTristan ended up having the day off, so we decided to take it easy and just hang out together for one last day. \n\nFirst up we played some games once breakfast and packing had been taken care of. We managed to play a bit here and there throughout my visit, so it was nice to have one last session.\n\nNext we walked to and around a bit of Hikarigaoka park (their local large one) again, and even found a small plum blossom grove that he didn't know was there! This was a nice relaxing way to spend some time and just chat.\n\nAfter that, it was getting close to lunch (at least for an early-ish lunch), so I made sure I had everything and we headed out for the rest of the day. We went to Saizeriya, an Italian restaurant where we had plenty of time and space to chat and enjoy some pizzas and drink bar.\n\nWith lunch over, we headed for Ginza, an area I can't remember seeing on any trip before. This is the \"up-market\" area of Tokyo, with high-end shops and cars everywhere! We really just saw the area and the shops, and looked through the Sony showroom store - nothing particularly picturesque, but it was still fun to see all the crazy expensive places, and multiple Ferraris, Porches, and even a Lamborghini or 2 haha.\n\nThe last thing we had a bit of time for was walking to the Tokyo station area (where I needed to catch my train from), and doing some train watching before grabbing a coffee to finish up. We went to a 6th floor observation rooftop area that overlooks Tokyo station's tracks, which was interesting to see - so many trains run so frequently, including the Shinkansen!\n\nAnd then it was time to leave. We said our farewells at the station and parted ways. The train ride to the airport was a little eventful - we had the emergency brakes activate and a 10 minute delay caused by a \"safety check\" (which was only communicated in English once we started moving properly again). My guess is there was some automated safeguard kicked in as a response to a false alarm fault. Still got to the airport with plenty of time, and not having to check luggage meant I could skip the queue and get through easily!\n\nThe flight home was pretty poor unfortunately - the plane was pretty close to full, so things were cramped, and I was in the middle seat between 2 people who weren't that respectful of the limited space available. At least the flight was 50 minutes shorter than scheduled!\n\nStill, the trip ended up being a very enjoyable and interesting one, and seeing Tristan and Naoko again, and for a good amount of time was fantastic! Definitely will be memories I'll hold onto for many years to come!","images":[{"src":"https://lh3.googleusercontent.com/d/1vqy_tA2M_90iR2hs1rLbrB-CIF62AO41?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1k6vQ4rPerlYI1W2GVfCcCpHKVNsF9kVZ?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1UGUsrwCq6yrPndH4WYNFRdDq2oVbqcy7?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1rphL6h21lgk4QOlaAFMYsBCJXAkKDKb6?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1mtDmR9GNQcjSMHKqddA0MDvu4fct0Luc?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/19puICfE9Gu53_102nXiniK1J5vIOXZg9?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1p3JyJWeSSkFxUXncp4GuDR4362UsckbM?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1sQhD1VrfeVq0vwSIDb9303h7weyhymvc?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1uFtfMwbMVMU88Qgvp13UO2EXMM0xg46c?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1A9Xhvv3zNFRIEHC8peWdLQJVR5sxebQp?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1KY9SgVunef7wsCoZu5WSXGifqJBVu80O?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1nrGMKKybWE07r4Vio5-dleCbvCY6HeL3?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1gU2pZQGeRt-1wGPudBLBAygNZqkV11nr?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1bz0WQsJY-rnzbG91cCxktJMRD5wv0jyD?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1aqX3WSnIQH92fK7Ba8vfWwhw_D2WvosK?authuser=0"}]}