{"id":"2020-japan-25","collection":"2020-japan","date":"2020 February 25","title":"Miyajima - Hiroshima","content":"Today was a day I didn’t know how I was going to handle - the plan was to visit the Hiroshima peace park / museum since I didn’t the last time I visited the area (12 or so years ago).\n\nAfter breakfast I checked out of my accommodation and left my luggage with my next accommodation - I wanted to spend one night at Iwaso so I could experience staying in a properly fancy ryokan. Initial signs were very positive! The staff were very friendly and spoke pretty good English as well.\n\nOnce that was sorted, I headed in to Hiroshima for the day. First stop was the A-Bomb Dome and surrounding peace park area. It was pretty interesting to see the structure look exactly as I remember it from all those years ago, and I’m pretty sure some of the photos I nabbed will be almost identical as a result. Reading about it, there have been a number of preservation works done on the structure to try to keep it looking like it did after the blast.\n\nThe rest of the peace park area was also how I remember it - I suspect the gravity of the location has meant the memories will always be there for me.\n\nThe final stop in the area was the museum. As expected, this place was very sombre and confronting. The photos and artworks in particular tell a heartwrenching story, especially combined with the context behind them. Still, being able to follow the timeline of events before and after the bomb was fascinating. I think this was the biggest take away for me - seeing how escalating international conflict during WWII resulted in the decision that using atomic bombs on 2 cities was the “best” option. It was hard not to see how that line of thinking has likely existed in some form ever since, and probably before as well. Ultimately though, the overwhelming message the museum presents is one of peace and harmony, and seeing how the city of Hiroshima thrives these days, it’s definitely a better take away than the alternative.\n\nI wanted to follow the museum visit up with a more positive experience - one that made me smile and enjoy the pleasures of life 🙂.\n\nThis meant finding Okonomimura, or “okonomiyaki village.” Three floors of small okonomiyaki bars, all with their own slight variations on the Hiroshima style of the well-known dish. I’ve never had it before, and now that I have, I’m disappointed I haven’t eaten more of it - for such a simple dish, it was incredibly tasty and fun to watch it being prepared! I suspect I might try Osaka style before I leave there…\n\nLast for the day was Shukkeien, a “shrunken” style garden. This was a nice relaxing place to visit, and showed off some really interestingly design landscape and trees. Finding out about the reason for certain elements existing in the garden was neat, and showed how this sort of garden has so many considerations given to it - most things have a place and reason for being where they are. For example, many of the elements of this garden were intended to represent local important natural landmarks, or historically valued concepts in Japanese culture. Also, there was a plum blossom grove woth many trees partially in bloom! For sure this garden was worth the cheap entrance fee, and it ended up being a rather unique experience to add to my trip!\n\nFrom there it was back to Miyajima island for a relaxed afternoon looking out over the water from a coffee shop, then enjoying the accommodation and dinner for the night!\n\nFollowing on from the initial experience at the accommodation for the night, check in was a totally new level - they called a staff member to show me to my room, who then proceeded to explain using the facilities in the ryokan, and brought in tea shortly after, then explained how to wear a yukata and how to use the room equipment.\n\nSee the next post for dinner onwards!","images":[{"src":"https://lh3.googleusercontent.com/d/1j11rxYuznR4PPXdM2jU05xQgtqjk2efk?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/198C1sX0kGynNgUMryLYhkDrD4vxd5m3l?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1WWNWaT8HrC0gQruhkMvUfMra9pyGBufr?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/11Omwt5bLAEn6WwBnMoCjTE1n48xh_Slu?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1DljYAjUtQoUpFPd5PJcEq6qD0imOgl7f?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1UfRY7q1XhZziDuQZiXE2VunkfxXkuQSS?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1iAHrtDBa-OYs7TNoAfOTXflCVs5rtBLW?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1VE56a7WEsv7lWYB7wDIuOYHcY160OXSB?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1Wp50xi4f7BuqHR1cdwcE1IEE__zJyAgf?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1jiMxUqHUoP6ODumnoje6s6zbPBXd4w7E?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1m-DLItRr7hMcZEqsZYSDJ2iyE8Xuahc9?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1yVVMZ1_81Se5MyKtfx0vnzwVpp9xrCM0?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1u2wFLSqKoTLpsS3Ivkg7MPlmseXtPtng?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1tNGyFvchfjxD0DIn3ljn3jRDBxidpE-a?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1lC_h6ezE18OLhSEZi-kyrFMLeC5dnMMV?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1Xr7wd7ma5NT0soXdYNardT5aozjtu_YS?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1RiiQiMrZPDEw-ZLrfnVQZigtVu7sd4Lc?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1HwCp-DFQRnzBHEvZLiaySp6Z0t55eB_q?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1G_3i-IsuKnIl2tESy0MLvSZFyhm1wH_z?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1VdcPUctTNFzS0wuwarraFy-0iKWOnado?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1mBPZabvq6xa7C4mZWLohQEzHT3wzSr6o?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/1hNZAr1e_atw0BJcgcLZZXUGEPSYljo_P?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1h_ILgxi8BxKbPOJ3kvZSQPrQpl9HInxH?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/16TV7p0CiLliItnVUMh0jApL36Kjnu9pF?authuser=0"},{"src":"https://lh3.googleusercontent.com/d/11uRnow9ixJ_2IZNb5hQzDabLd_p8aiWv?authuser=0","collageSrc":"https://lh3.googleusercontent.com/d/1WABv5T3WRVI7rLE55vKfQXpcrgYo7vvs?authuser=0","navSrc":"https://lh3.googleusercontent.com/d/1fkx3X1EXtEKLQ5w4akmmf8tFEe4Li7At?authuser=0"}]}